stress_test/read-heavy-test.yml
config:
  target: "http://127.0.0.1:8001"
  environments:
    fastapi-sync:
      target: "http://127.0.0.1:8001"
    fastapi-async:
      target: "http://127.0.0.1:8002"
    express:
      target: "http://127.0.0.1:3000"
  phases:
    - duration: 180
      arrivalRate: 50
      name: "Read operations"
  ensure:
    maxErrorRate: 1
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "seed_items_before_read"
    weight: 0  # only used for setup
    before:
      flow:
        - loop:
            count: 50
            loop:
              - post:
                  url: "/items"
                  json:
                    name: "Item {{ $loopElement }}"
                    description: "Seeded item for read-heavy test"
              - think: 0.1
        - think: 2
    flow:
      - think: 0  # no actual load test here

  - name: "read_item_lists"
    weight: 1
    flow:
      - get:
          url: "/items/?skip={{ $randomNumber(0, 40) }}&limit=10"
          expect:
            - statusCode: 200
      - think: 0.2