stress_test/read-heavy-test.yml
config:
  target: "http://127.0.0.1:8001"
  processor: "./functions.js" 
  variables:
    seedCount: 50
  environments:
    fastapi-sync:
      target: "http://127.0.0.1:8001"
    fastapi-async:
      target: "http://127.0.0.1:8002"
    express:
      target: "http://127.0.0.1:3000"
  phases:
    - duration: 180
      arrivalRate: 50
      name: "Read operations"
  ensure:
    maxErrorRate: 1
  plugins:
    metrics-by-endpoint: {}
 

before:
  flow:
    - log: "Starting data seeding"
    - function: "seedTestData"
    - log: "Data seeding completed"
    - think: 1  

scenarios:
  - name: "read_item_lists"
    weight: 1
    flow:
      - get:
          url: "/items/?skip={{ $randomNumber(0, 40) }}&limit=10"
          expect:
            - statusCode: 200
      - think: 0.1

  - name: "read_item_by_id"
    weight: 1
    flow:
      - get:
          url: "/items/{{ $randomNumber(1, 50) }}"
          expect:
            - statusCode: 200
      - think: 0.1